#!/usr/bin/env bash

getNumberName() {
  local  __output=$1
  local  output=""

  input=$2

  case $input in
    0)
       output="ноль" # |нуль"
       ;;
    1)
       output="один" # |одна|одно|одни"
       ;;
    2)
       output="два" # | |две"
       ;;
    3)
       output="три"
       ;;
    4)
       output="четыре"
       ;;
    5)
       output="пять"
       ;;
    6)
       output="шесть"
       ;;
    7)
       output="семь"
       ;;
    8)
       output="восемь"
       ;;
    9)
       output="девять"
       ;;
    10)
       output="десять"
       ;;
    11)
       output="одиннадцать"
       ;;
    12)
       output="двенадцать"
       ;;
    13)
       output="тринадцать"
       ;;
    14)
       output="четырнадцать"
       ;;
    15)
       output="пятнадцать"
       ;;
    16)
       output="шестнадцать"
       ;;
    17)
       output="семнадцать"
       ;;
    18)
       output="восемнадцать"
       ;;
    19)
       output="девятнадцать"
       ;;
    20)
       output="двадцать"
       ;;
    21)
       output="двадцать один" # |двадцать одна|двадцать одно"
       ;;
    22)
       output="двадцать два" # | |двадцать две"
       ;;
    23)
       output="двадцать три"
       ;;
    24)
       output="двадцать четыре"
       ;;
    25)
       output="двадцать пять"
       ;;
    26)
       output="двадцать шесть"
       ;;
    27)
       output="двадцать семь"
       ;;
    28)
       output="двадцать восемь"
       ;;
    29)
       output="двадцать девять"
       ;;
    30)
       output="тридцать"
       ;;
    31)
       output="тридцать один" # |тридцать одна|тридцать одно"
       ;;
    32)
       output="тридцать два" # | |тридцать две"
       ;;
    33)
       output="тридцать три"
       ;;
    34)
       output="тридцать четыре"
       ;;
    35)
       output="тридцать пять"
       ;;
    36)
       output="тридцать шесть"
       ;;
    37)
       output="тридцать семь"
       ;;
    38)
       output="тридцать восемь"
       ;;
    39)
       output="тридцать девять"
       ;;
    40)
       output="сорок"
       ;;
    41)
       output="сорок один" # |сорок одна|сорок одно"
       ;;
    42)
       output="сорок два" # | |сорок две"
       ;;
    43)
       output="сорок три"
       ;;
    44)
       output="сорок четыре"
       ;;
    45)
       output="сорок пять"
       ;;
    46)
       output="сорок шесть"
       ;;
    47)
       output="сорок семь"
       ;;
    48)
       output="сорок восемь"
       ;;
    49)
       output="сорок девять"
       ;;
    50)
       output="пятьдесят"
       ;;
    51)
       output="пятьдесят один" # |пятьдесят одна|пятьдесят одно"
       ;;
    52)
       output="пятьдесят два" # | |пятьдесят две"
       ;;
    53)
       output="пятьдесят три"
       ;;
    54)
       output="пятьдесят четыре"
       ;;
    55)
       output="пятьдесят пять"
       ;;
    56)
       output="пятьдесят шесть"
       ;;
    57)
       output="пятьдесят семь"
       ;;
    58)
       output="пятьдесят восемь"
       ;;
    59)
       output="пятьдесят девять"
       ;;
    60)
       output="шестьдесят"
       ;;
    61)
       output="шестьдесят один" # |шестьдесят одна|шестьдесят одно"
       ;;
    62)
       output="шестьдесят два" # | |шестьдесят две"
       ;;
    63)
       output="шестьдесят три"
       ;;
    64)
       output="шестьдесят четыре"
       ;;
    65)
       output="шестьдесят пять"
       ;;
    66)
       output="шестьдесят шесть"
       ;;
    67)
       output="шестьдесят семь"
       ;;
    68)
       output="шестьдесят восемь"
       ;;
    69)
       output="шестьдесят девять"
       ;;
    70)
       output="семьдесят"
       ;;
    71)
       output="семьдесят один" # |семьдесят одна|семьдесят одно"
       ;;
    72)
       output="семьдесят два" # | |семьдесят две"
       ;;
    73)
       output="семьдесят три"
       ;;
    74)
       output="семьдесят четыре"
       ;;
    75)
       output="семьдесят пять"
       ;;
    76)
       output="семьдесят шесть"
       ;;
    77)
       output="семьдесят семь"
       ;;
    78)
       output="семьдесят восемь"
       ;;
    79)
       output="семьдесят девять"
       ;;
    80)
       output="восемьдесят"
       ;;
    81)
       output="восемьдесят один" # |восемьдесят одна|восемьдесят одно"
       ;;
    82)
       output="восемьдесят два" # | |восемьдесят две"
       ;;
    83)
       output="восемьдесят три"
       ;;
    84)
       output="восемьдесят четыре"
       ;;
    85)
       output="восемьдесят пять"
       ;;
    86)
       output="восемьдесят шесть"
       ;;
    87)
       output="восемьдесят семь"
       ;;
    88)
       output="восемьдесят восемь"
       ;;
    89)
       output="восемьдесят девять"
       ;;
    90)
       output="девяносто"
       ;;
    91)
       output="девяносто один" # |девяносто одна|девяносто одно"
       ;;
    92)
       output="девяносто два" # | |девяносто две"
       ;;
    93)
       output="девяносто три"
       ;;
    94)
       output="девяносто четыре"
       ;;
    95)
       output="девяносто пять"
       ;;
    96)
       output="девяносто шесть"
       ;;
    97)
       output="девяносто семь"
       ;;
    98)
       output="девяносто восемь"
       ;;
    99)
       output="девяносто девять"
  esac


  eval $__output="'$output'"
}

for ii in `seq 0 99`;
do
  getNumberName return_value $ii
  echo $return_value
done    